; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v1 ?v9)
             (pred_6 ?v12 ?v13)
             (pred_8 ?v1 ?v13)
             (pred_9 ?v3 ?v1 )
	     (pred_1 ?v1)
             (pred_7 ?v10)
             (pred_5 ?v12)
             (pred_2 ?v13)
             (pred_3 ?v1)
             (pred_12 ?v12)
             (pred_4 ?v1)
             (pred_10 ))



(:action op_5
:parameters (?v11 ?v4 ?v6 ?v8)
:precondition (and (pred_7 ?v11) (pred_7 ?v4) (pred_5 ?v6) (pred_2 ?v8)
          (pred_11 ?v11 ?v4) (pred_6 ?v6 ?v8)
                   (pred_8 ?v4 ?v8) (pred_1 ?v11) 
                   (pred_3 ?v4) (pred_12 ?v6))
:effect (and  (pred_4 ?v4) (not (pred_3 ?v4))))


(:action op_3
:parameters (?v11 ?v7)
:precondition (and (pred_7 ?v11) (pred_7 ?v7)
               (pred_1 ?v11) (pred_11 ?v11 ?v7) (pred_4 ?v7))
:effect (and (pred_1 ?v7) (not (pred_1 ?v11))))

(:action op_1
:parameters (?v11 ?v6)
:precondition (and (pred_7 ?v11) (pred_5 ?v6) 
                  (pred_1 ?v11) (pred_9 ?v6 ?v11) (pred_10 ))
:effect (and (pred_12 ?v6)
   (not (pred_9 ?v6 ?v11)) (not (pred_10 ))))


(:action op_2
:parameters (?v11 ?v5 ?v2)
:precondition (and (pred_7 ?v11) (pred_5 ?v5) (pred_5 ?v2)
                  (pred_1 ?v11) (pred_12 ?v2) (pred_9 ?v5 ?v11))
:effect (and (pred_12 ?v5) (pred_9 ?v2 ?v11)
        (not (pred_12 ?v2)) (not (pred_9 ?v5 ?v11))))

(:action op_4
:parameters (?v11 ?v6)
:precondition (and (pred_7 ?v11) (pred_5 ?v6) 
                  (pred_1 ?v11) (pred_12 ?v6))
:effect (and (pred_10 ) (pred_9 ?v6 ?v11) (not (pred_12 ?v6)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_04 obj_17 obj_11 obj_09 obj_03 obj_08 obj_21 obj_01 obj_20 obj_15 obj_06 obj_19 obj_02 obj_13 obj_05
    obj_10 obj_18
    obj_14 obj_07 obj_12
    )

    (:init
       (pred_10)

       (pred_7 obj_16)
       (pred_7 obj_04)
       (pred_7 obj_17)
       (pred_7 obj_11)
       (pred_7 obj_09)
       (pred_7 obj_03)
       (pred_7 obj_08)
       (pred_7 obj_21)
       (pred_7 obj_01)
       (pred_7 obj_20)
       (pred_7 obj_15)
       (pred_7 obj_06)
       (pred_7 obj_19)
       (pred_7 obj_02)
       (pred_7 obj_13)
       (pred_7 obj_05)
       (pred_2 obj_10)
       (pred_2 obj_18)
       (pred_5 obj_14)
       (pred_5 obj_07)
       (pred_5 obj_12)

       (pred_11 obj_16 obj_09)
       (pred_11 obj_16 obj_04)
       (pred_11 obj_04 obj_03)
       (pred_11 obj_04 obj_17)
       (pred_11 obj_04 obj_16)
       (pred_11 obj_17 obj_08)
       (pred_11 obj_17 obj_11)
       (pred_11 obj_17 obj_04)
       (pred_11 obj_11 obj_21)
       (pred_11 obj_11 obj_17)
       (pred_11 obj_09 obj_01)
       (pred_11 obj_09 obj_03)
       (pred_11 obj_09 obj_16)
       (pred_11 obj_03 obj_20)
       (pred_11 obj_03 obj_08)
       (pred_11 obj_03 obj_04)
       (pred_11 obj_03 obj_09)
       (pred_11 obj_08 obj_15)
       (pred_11 obj_08 obj_21)
       (pred_11 obj_08 obj_17)
       (pred_11 obj_08 obj_03)
       (pred_11 obj_21 obj_06)
       (pred_11 obj_21 obj_11)
       (pred_11 obj_21 obj_08)
       (pred_11 obj_01 obj_19)
       (pred_11 obj_01 obj_20)
       (pred_11 obj_01 obj_09)
       (pred_11 obj_20 obj_02)
       (pred_11 obj_20 obj_15)
       (pred_11 obj_20 obj_03)
       (pred_11 obj_20 obj_01)
       (pred_11 obj_15 obj_13)
       (pred_11 obj_15 obj_06)
       (pred_11 obj_15 obj_08)
       (pred_11 obj_15 obj_20)
       (pred_11 obj_06 obj_05)
       (pred_11 obj_06 obj_21)
       (pred_11 obj_06 obj_15)
       (pred_11 obj_19 obj_02)
       (pred_11 obj_19 obj_01)
       (pred_11 obj_02 obj_13)
       (pred_11 obj_02 obj_20)
       (pred_11 obj_02 obj_19)
       (pred_11 obj_13 obj_05)
       (pred_11 obj_13 obj_15)
       (pred_11 obj_13 obj_02)
       (pred_11 obj_05 obj_06)
       (pred_11 obj_05 obj_13)
       (pred_3 obj_05)
       (pred_3 obj_13)
       (pred_3 obj_16)
       (pred_8  obj_05 obj_10)
       (pred_8  obj_13 obj_18)
       (pred_8  obj_16 obj_10)
       (pred_4 obj_04)
       (pred_4 obj_17)
       (pred_4 obj_11)
       (pred_4 obj_09)
       (pred_4 obj_03)
       (pred_4 obj_08)
       (pred_4 obj_21)
       (pred_4 obj_01)
       (pred_4 obj_20)
       (pred_4 obj_15)
       (pred_4 obj_06)
       (pred_4 obj_19)
       (pred_4 obj_02)

       (pred_6  obj_14 obj_10)
       (pred_6  obj_07 obj_18)
       (pred_6  obj_12 obj_18)
       (pred_9 obj_14 obj_17)
       (pred_9 obj_07 obj_03)
       (pred_9 obj_12 obj_05)
       (pred_1 obj_03)
    )

    (:goal (and
       (pred_9 obj_14 obj_20)
       (pred_9 obj_07 obj_06)
    ))
(:constraints
  (always (not (pred_1 obj_21)))
)
)

; plan
1. (op_1 obj_03 obj_07)
   deleted: (pred_9 obj_07 obj_03) (pred_10)
   added: (pred_12 obj_07)
   goals met: 0 of 2
2. (op_3 obj_03 obj_08)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_08)
   goals met: 0 of 2
3. (op_3 obj_08 obj_15)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_15)
   goals met: 0 of 2
4. (op_3 obj_15 obj_06)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_06)
   goals met: 0 of 2
5. (op_4 obj_06 obj_07)
   deleted: (pred_12 obj_07)
   added: (pred_10) (pred_9 obj_07 obj_06)
   goals met: 1 of 2
6. (op_3 obj_06 obj_15)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_15)
   goals met: 1 of 2
7. (op_3 obj_15 obj_08)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_08)
   goals met: 1 of 2
8. (op_3 obj_08 obj_17)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_17)
   goals met: 1 of 2
9. (op_1 obj_17 obj_14)
   deleted: (pred_9 obj_14 obj_17) (pred_10)
   added: (pred_12 obj_14)
   goals met: 1 of 2
10. (op_3 obj_17 obj_04)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_04)
   goals met: 1 of 2
11. (op_3 obj_04 obj_03)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_03)
   goals met: 1 of 2
12. (op_3 obj_03 obj_20)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_20)
   goals met: 1 of 2
13. (op_4 obj_20 obj_14)
   deleted: (pred_12 obj_14)
   added: (pred_10) (pred_9 obj_14 obj_20)
   goals met: 2 of 2
